publish/use-github-action-deploy-blog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>使用 GitHub Actions 部署博客到 GitHub Pages</title>
<meta name="author" content="Spike Leung" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../styles/style.css" type="text/css"/>
<link rel="icon" href="/favicon.ico" type="image/x-icon">
</head>
<body>
<div id="preamble" class="status">

 <nav>
  <ul>
    <li><a href="/index.html">Home</a></li>
    <li><a href="/about.html">About</a></li>
    <li><a href="/rss.xml">RSS</a></li>
    <li><a href="https://github.com/Spike-Leung/taxodium/tree/org-publish">GitHub</a></li>
    <li><a href="https://music.163.com/#/playlist?id=12531191848">Playlist</a></li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">使用 GitHub Actions 部署博客到 GitHub Pages</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbdf7eea">GitHub Actions</a>
<ul>
<li><a href="#orgcb93aa0">为什么用 GitHub Actions</a></li>
<li><a href="#org84ec174">什么是 GitHub Actions</a>
<ul>
<li><a href="#orgd25965c">Event-Driven</a></li>
<li><a href="#org705829e">创建 GitHub Actions</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga69ef44">参考链接</a></li>
</ul>
</div>
</div>
<p>
笔者目前的博客使用的是 <a href="https://v2.vuepress.vuejs.org/">Vuepress</a>, 参考文档，使用 <code>Travis CI</code> 实现了博客推送更新后自动部署。
</p>

<p>
最近了解到 <code>GitHub Actions</code> ，遂将博客的自动部署改为 <code>GitHub Actions</code> 。
</p>

<p>
本文将简单介绍 <code>GitHub Actions</code> 以及笔者博客如何实现自动部署。
</p>

<div id="outline-container-orgbdf7eea" class="outline-2">
<h2 id="orgbdf7eea">GitHub Actions</h2>
<div class="outline-text-2" id="text-orgbdf7eea">
</div>
<div id="outline-container-orgcb93aa0" class="outline-3">
<h3 id="orgcb93aa0">为什么用 GitHub Actions</h3>
<div class="outline-text-3" id="text-orgcb93aa0">
<ul class="org-ul">
<li><del>尝鲜</del></li>
<li>它和 `GitHub` 集成到一起，方便</li>
<li>有很多别人已经写好的 <a href="https://github.com/marketplace?type=actions">actions</a> 可以直接拿来用，避免重复造轮子，节省时间</li>
<li>&#x2026;</li>
</ul>
</div>
</div>

<div id="outline-container-org84ec174" class="outline-3">
<h3 id="org84ec174">什么是 GitHub Actions</h3>
<div class="outline-text-3" id="text-org84ec174">
</div>
<div id="outline-container-orgd25965c" class="outline-4">
<h4 id="orgd25965c">Event-Driven</h4>
<div class="outline-text-4" id="text-orgd25965c">
<blockquote>
<p>
GitHub Actions are event-driven, meaning that you can run a series of commands after a specified event has occurred
</p>
</blockquote>

<p>
<code>GitHub Actions</code> 它是事件驱动的，当某个事件，例如 <code>push</code> ， <code>merge</code> 发生的时候，就触发对应的处理 <a href="https://docs.github.com/en/actions/learn-github-actions/introduction-to-github-actions*workflows">workflows</a>
</p>
</div>
</div>

<div id="outline-container-org705829e" class="outline-4">
<h4 id="org705829e">创建 GitHub Actions</h4>
<div class="outline-text-4" id="text-org705829e">
<ol class="org-ol">
<li>在 Git 仓库下创建 <code>.github/workflows</code> 目录， 目录下创建一个对应的 <code>xxxx.yaml</code> 配置文件，每个 <code>yaml</code> 文件对应一个 <code>workflows</code></li>
<li><p>
一个 <code>xxx.yaml</code> 文件，内容大致如下：(这是我的博客的部署 <code>workflows</code>, 具体含义见注释)
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #969896;"># </span><span style="color: #7f0000;">Optional - The name of the workflow as it will appear in the Actions tab of the GitHub repository.</span>
<span style="color: #969896;"># </span><span style="color: #7f0000;">workflows &#30340;&#21517;&#31216;</span>
<span style="color: #005e8b;">name</span>: deploy-to-github-page
<span style="color: #969896;"># </span><span style="color: #7f0000;">Specify the event that automatically triggers the workflow file.</span>
<span style="color: #969896;"># </span><span style="color: #7f0000;">&#30417;&#21548;&#20160;&#20040;&#20107;&#20214;&#26102;&#35302;&#21457;&#36825;&#20010;workflows, &#36825;&#37324;&#30417;&#21548;push</span>
<span style="color: #0000b0;">on</span>: [push]
<span style="color: #969896;"># </span><span style="color: #7f0000;">Groups together all the jobs that run in the workflow file</span>
<span style="color: #969896;"># </span><span style="color: #7f0000;">&#36825;&#20010;workflows&#20855;&#20307;&#26159;&#30001;&#21738;&#20123;&#20219;&#21153;&#32452;&#25104;&#30340;</span>
<span style="color: #005e8b;">jobs</span>:
  <span style="color: #969896;"># </span><span style="color: #7f0000;">define job name</span>
  <span style="color: #969896;"># </span><span style="color: #7f0000;">&#20219;&#21153;1, `deploy`&#26159;&#20219;&#21153;&#30340;&#21517;&#31216;</span>
  <span style="color: #005e8b;">deploy</span>:
    <span style="color: #969896;"># </span><span style="color: #7f0000;">Configures the job to run on an Ubuntu Linux runner</span>
    <span style="color: #969896;"># </span><span style="color: #7f0000;">&#22312;&#20160;&#20040;&#29615;&#22659;&#19979;&#25191;&#34892;&#36825;&#20010;&#20219;&#21153;</span>
    <span style="color: #005e8b;">runs-on</span>: ubuntu-latest
    <span style="color: #969896;"># </span><span style="color: #7f0000;">Groups together all the steps that run in the job</span>
    <span style="color: #969896;"># </span><span style="color: #7f0000;">Each item nested under this section is a separate action or shell command.</span>
    <span style="color: #969896;"># </span><span style="color: #7f0000;">&#20219;&#21153;&#20855;&#20307;&#21253;&#21547;&#20160;&#20040;&#27493;&#39588;</span>
    <span style="color: #005e8b;">steps</span>:
      <span style="color: #969896;"># </span><span style="color: #7f0000;">actions The uses keyword tells the job to retrieve v2 of the community action named actions/checkout@v2</span>
      <span style="color: #969896;"># </span><span style="color: #7f0000;">&#27599;&#20010;&#27493;&#39588;&#65292;&#21363;&#21487;&#20197;&#20351;&#29992;(`uses`)&#21035;&#20154;&#20889;&#22909;&#30340;`actions`, &#20063;&#21487;&#20197;&#36305;&#33258;&#24049;&#20889;&#30340;&#21629;&#20196;(`run`)</span>
      - <span style="color: #005e8b;">uses</span>: actions/checkout@v2 <span style="color: #969896;"># </span><span style="color: #7f0000;">&#25289;&#21462;&#20195;&#30721;</span>
        - <span style="color: #005e8b;">uses</span>: actions/setup-node@v2 <span style="color: #969896;"># </span><span style="color: #7f0000;">&#35013;node.js&#29615;&#22659;</span>
          <span style="color: #005e8b;">with</span>: <span style="color: #969896;"># </span><span style="color: #7f0000;">&#36755;&#20837;&#36825;&#20010;`actions`&#38656;&#35201;&#30340;&#21442;&#25968;&#65292;&#20363;&#22914;&#29256;&#26412;&#21495;</span>
          <span style="color: #005e8b;">node-version</span>: <span style="color: #3548cf;">'14'</span>
          <span style="color: #969896;"># </span><span style="color: #7f0000;">shell command, The run keyword tells the job to execute a command on the runner.</span>
          - <span style="color: #005e8b;">run</span>: yarn install <span style="color: #969896;"># </span><span style="color: #7f0000;">&#23433;&#35013;&#21338;&#23458;&#30340;&#20381;&#36182;</span>
            - <span style="color: #005e8b;">run</span>: yarn build <span style="color: #969896;"># </span><span style="color: #7f0000;">&#26500;&#24314;&#21338;&#23458;&#30340;&#38745;&#24577;&#25991;&#20214;</span>
              - <span style="color: #005e8b;">name</span>: Deploy
                <span style="color: #005e8b;">uses</span>: peaceiris/actions-gh-pages@v3 <span style="color: #969896;"># </span><span style="color: #7f0000;">&#20351;&#29992;&#21035;&#20154;&#20889;&#22909;&#25226;&#38745;&#24577;&#25991;&#20214;&#21457;&#24067;&#21040;`GitHub Pages`&#30340;`actions`</span>
                <span style="color: #005e8b;">with</span>:
                  <span style="color: #005e8b;">github_token</span>: ${{ secrets.GITHUB_TOKEN }}
                  <span style="color: #005e8b;">publish_dir</span>: docs/.vuepress/dist

</pre>
</div></li>
</ol>


<p>
部署博客的 <code>workflows</code> 还是蛮简单的，阅读配置文件，可以发现 <code>GitHub Actions</code> 的大致流程是这样的:
</p>

<ul class="org-ul">
<li>当某个事件发生，例如 <code>push</code>
<ul class="org-ul">
<li>触发 <code>workflows</code> ， 对应 <code>.github/workflows</code> 目录下定义的 <code>yaml</code> 配置</li>
<li>每个 <code>workflows</code>
<ul class="org-ul">
<li>定义匹配什么事件 (<code>on: push</code>)</li>
<li>定义都有那些任务 (<code>jobs</code>)
<ul class="org-ul">
<li><code>jobs</code> 中定义任务的执行环境 (<code>runs-on</code>)</li>
<li>每个 <code>jobs</code> 是由一个一个步骤 (<code>steps</code>) 组成的
<ul class="org-ul">
<li>每个 <code>steps</code> 可以是
<ul class="org-ul">
<li><code>uses</code> 别人写好的 <code>actions</code></li>
<li><p>
<code>run</code> 自己定义的命令
</p>

<p>
所以，思考你想在仓库发生什么事件时，做什么任务，这个任务具体包含哪些步骤，然后编写一个配置文件，就差不多了。
</p></li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-orga69ef44" class="outline-2">
<h2 id="orga69ef44">参考链接</h2>
<div class="outline-text-2" id="text-orga69ef44">
<ul class="org-ul">
<li><a href="https://www.devopsauthority.tech/2021/02/09/github-actions-vs-travis-ci/">GitHub Actions vs Travis CI – Comparing CI/CD Platforms</a></li>
<li><a href="https://docs.github.com/en/actions/learn-github-actions/introduction-to-github-actions">Introduction to GitHub Actions</a></li>
<li><a href="https://yaml.org/">YAML</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">

<p class="author">Author: <a href="mailto:l-yanlei@hotmail.com">Spike Leung</a></p>
<p class="date">Date: 2021-08-15 Sun 00:00</p>
<p class="license">License: <a href="https://www.creativecommons.org/licenses/by-nc/4.0/deed.zh-hans">CC BY-NC 4.0</a></p>
<script src="https://giscus.app/client.js"
        data-repo="Spike-Leung/taxodium"
        data-repo-id="MDEwOlJlcG9zaXRvcnkzOTYyNDQwMzk="
        data-category="Announcements"
        data-category-id="DIC_kwDOF540R84Ci61D"
        data-mapping="pathname"
        data-strict="0"
        data-reactions-enabled="1"
        data-emit-metadata="0"
        data-input-position="top"
        data-theme="light_high_contrast"
        data-lang="en"
        data-loading="lazy"
        crossorigin="anonymous"
        async>
</script>
</div>
</body>
</html>
